app/Http/Controllers/PostController.php

    public function index(){
        $productos = Producto::paginate(6);
---
select count(*) as aggregate from `productos`